fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРабот/ВКМ_ЗаполнениеГрафикаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафикаРабот</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРабот/ВКМ_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРабот</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРабот</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни,ГрафикРабот) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРабот.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРабот.Установить(ГрафикРабот);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ДатаКЗаписи = ДатаНачала;
	Для НомерЗаписи = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[НомерЗаписи];
		Если Запись.Дата < ДатаНачала Тогда
			
			Продолжить;
			
		ИначеЕсли Запись.Дата = ДатаКЗаписи Тогда
			
			Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) Тогда
				Запись.Значение = 0;
			Иначе	          
				Запись.Значение = 1;
			КонецЕсли;
			ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
			
		Иначе
			
			Пока ДатаКЗаписи < Мин(Запись.Дата, ДатаОкончания + ЧислоСекундВСутках) Цикл
				
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ГрафикРабот = ГрафикРабот;
				НоваяЗапись.Дата = ДатаКЗаписи;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) Тогда
					НоваяЗапись.Значение = 0;
				Иначе	          
					НоваяЗапись.Значение = 1;
				КонецЕсли; 
				ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
				
			КонецЦикла;
			
			Если Запись.Дата > ДатаОкончания Тогда
				
				Прервать;
				
			ИначеЕсли Запись.Дата <= ДатаОкончания Тогда
				
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Запись.Дата))) Тогда
					Запись.Значение = 0;
				Иначе	          
					Запись.Значение = 1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;

	Пока ДатаКЗаписи <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ГрафикРабот = ГрафикРабот;
		Запись.Дата = ДатаКЗаписи;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) Тогда
			Запись.Значение = 0;
		Иначе	          
			Запись.Значение = 1;
		КонецЕсли; 
		ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
